//
//  CardData.swift
//  Campus
//
//  Created by bowtie on 21.04.2022.
//

import SwiftUI

let cardsData: [Card] = [
    Card(image: "a_of_h", title: "Решала", description: "Ты решаешь, кому пить. Укажи пальцем на счастливчика."),
    Card(image: "6_of_h", title: "Алкаш", description: "Ты выпиваешь."),
    Card(image: "7_of_h", title: "Считалка", description: "По часовой стрелке по очереди, начиная с тебя, все считают вслух, но с одним условием: нельзя называть числа, в которых есть 7, или те, которые делятся на 7. Например, 1, 2, 3, 4, 5, 6, 8...12, 13, 15, 16, 18."),
    Card(image: "8_of_h", title: "[Не]омерзительная 8", description: "Восьмерка защищает. С этой картой один раз можешь не пить."),
    Card(image: "9_of_h", title: "Животные", description: "По часовой стрелке по очереди, начиная с тебя, все называют животных. Кто называет животное, которое уже было озвучено, выпивает."),
    Card(image: "10_of_h", title: "Города", description: "По часовой стрелке по очереди, начиная с тебя, все называют города. Кто называет город, который уже был озвучен, выпивает."),
    Card(image: "j_of_h", title: "Условие", description: "Например, что-то сказать или сделать перед тем как выпьешь. Если забудешь выполнить условие, выпиваешь. Если забудешь само условие, никто не должен  подсказывать, иначе будет пить вместе с тобой."),
    Card(image: "q_of_h", title: "Можно спросить?", description: "Кто последний поднял руку, пьет."),
    Card(image: "k_of_h", title: "Молчать!", description: "На твои вопросы нельзя отвечать до тех пор, пока кто-то другой не вытянет короля. Твоя же задача – всех достать вопросами. Кто тебе ответит, тот выпивает."),
    Card(image: "a_of_s", title: "Решала", description: "Ты решаешь, кому пить. Укажи пальцем на счастливчика."),
    Card(image: "6_of_s", title: "Алкаш", description: "Ты выпиваешь."),
    Card(image: "7_of_s", title: "Считалка", description: "По часовой стрелке по очереди, начиная с тебя, все считают вслух, но с одним условием: нельзя называть числа, в которых есть 7, или те, которые делятся на 7. Например, 1, 2, 3, 4, 5, 6, 8...12, 13, 15, 16, 18."),
    Card(image: "8_of_s", title: "[Не]омерзительная 8", description: "Восьмерка защищает. С этой картой один раз можешь не пить."),
    Card(image: "9_of_s", title: "Животные", description: "По часовой стрелке по очереди, начиная с тебя, все называют животных. Кто называет животное, которое уже было озвучено, выпивает."),
    Card(image: "10_of_s", title: "Города", description: "По часовой стрелке по очереди, начиная с тебя, все называют города. Кто называет город, который уже был озвучен, выпивает."),
    Card(image: "j_of_s", title: "Условие", description: "Например, что-то сказать или сделать перед тем как выпьешь. Если забудешь выполнить условие, выпиваешь. Если забудешь само условие, никто не должен  подсказывать, иначе будет пить вместе с тобой."),
    Card(image: "q_of_s", title: "Можно спросить?", description: "Кто последний поднял руку, пьет."),
    Card(image: "k_of_s", title: "Молчать!", description: "На твои вопросы нельзя отвечать до тех пор, пока кто-то другой не вытянет короля. Твоя же задача – всех достать вопросами. Кто тебе ответит, тот выпивает."),
    Card(image: "a_of_d", title: "Решала", description: "Ты решаешь, кому пить. Укажи пальцем на счастливчика."),
    Card(image: "6_of_d", title: "Алкаш", description: "Ты выпиваешь."),
    Card(image: "7_of_d", title: "Считалка", description: "По часовой стрелке по очереди, начиная с тебя, все считают вслух, но с одним условием: нельзя называть числа, в которых есть 7, или те, которые делятся на 7. Например, 1, 2, 3, 4, 5, 6, 8...12, 13, 15, 16, 18."),
    Card(image: "8_of_d", title: "[Не]омерзительная 8", description: "Восьмерка защищает. С этой картой один раз можешь не пить."),
    Card(image: "9_of_d", title: "Животные", description: "По часовой стрелке по очереди, начиная с тебя, все называют животных. Кто называет животное, которое уже было озвучено, выпивает."),
    Card(image: "10_of_d", title: "Города", description: "По часовой стрелке по очереди, начиная с тебя, все называют города. Кто называет город, который уже был озвучен, выпивает."),
    Card(image: "j_of_d", title: "Условие", description: "Например, что-то сказать или сделать перед тем как выпьешь. Если забудешь выполнить условие, выпиваешь. Если забудешь само условие, никто не должен  подсказывать, иначе будет пить вместе с тобой."),
    Card(image: "q_of_d", title: "Можно спросить?", description: "Кто последний поднял руку, пьет."),
    Card(image: "k_of_d", title: "Молчать!", description: "На твои вопросы нельзя отвечать до тех пор, пока кто-то другой не вытянет короля. Твоя же задача – всех достать вопросами. Кто тебе ответит, тот выпивает."),
    Card(image: "a_of_c", title: "Решала", description: "Ты решаешь, кому пить. Укажи пальцем на счастливчика."),
    Card(image: "6_of_c", title: "Алкаш", description: "Ты выпиваешь."),
    Card(image: "7_of_c", title: "Считалка", description: "По часовой стрелке по очереди, начиная с тебя, все считают вслух, но с одним условием: нельзя называть числа, в которых есть 7, или те, которые делятся на 7. Например, 1, 2, 3, 4, 5, 6, 8...12, 13, 15, 16, 18."),
    Card(image: "8_of_c", title: "[Не]омерзительная 8", description: "Восьмерка защищает. С этой картой один раз можешь не пить."),
    Card(image: "9_of_c", title: "Животные", description: "По часовой стрелке по очереди, начиная с тебя, все называют животных. Кто называет животное, которое уже было озвучено, выпивает."),
    Card(image: "10_of_c", title: "Города", description: "По часовой стрелке по очереди, начиная с тебя, все называют города. Кто называет город, который уже был озвучен, выпивает."),
    Card(image: "j_of_c", title: "Условие", description: "Например, что-то сказать или сделать перед тем как выпьешь. Если забудешь выполнить условие, выпиваешь. Если забудешь само условие, никто не должен  подсказывать, иначе будет пить вместе с тобой."),
    Card(image: "q_of_c", title: "Можно спросить?", description: "Кто последний поднял руку, пьет."),
    Card(image: "k_of_c", title: "Молчать!", description: "На твои вопросы нельзя отвечать до тех пор, пока кто-то другой не вытянет короля. Твоя же задача – всех достать вопросами. Кто тебе ответит, тот выпивает.")
]
